In [2]:
import numpy as np
import pandas as pd

labels = ['a', 'b', 'c']
my_data = [10,20,30]
arr = np.array(my_data)
d = {'a':10, 'b':20, 'c':30}

Data

In [3]:
pd.Series(data = my_data)
pd.Series(data = my_data, index=labels)
pd.Series(my_data, labels)
pd.Series(arr, labels)
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [4]:
ser1 = pd.Series([1,2,3,4], ['USA', 'Germany', 'USSR', 'Japan'])
ser2 = pd.Series([1,2,3,4], ['USA', 'Germany', 'Italy', 'Japan'])

# your index is the label
ser1['USA']

#will add the datas (values) where the labels match and null for where it doesn't
#convert to floats
ser1 + ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

DataFrames

In [5]:
from numpy.random import randn
np.random.seed(101)

df = pd.DataFrame(randn(5,4), ['A', 'B', 'C', 'D', 'E'], ['W', 'X', 'Y', 'Z'])
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [6]:
#This is a series
df['W']
type(df['W'])

df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [7]:
#creating new column and arithmetic of columns
df['new'] = df['W'] + df['Z']

#dropping columns or rows
#rows are 0 axis and columns are 1 axis
df.drop('new', axis=1, inplace=True)
df.drop('E', axis=0)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [8]:
df.shape

#columns
df[['Z','X']]

# returns rows
df.loc['A']
#or
df.iloc[0]

#both columns and rows are returned as rows

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [9]:
#pandas splicing
df.loc[['A','B'],['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

In [10]:
#Conditional Selection

#returns true wherever value > 0
booldf = df > 0

#values where conditions is correct
df[booldf]

df['W']>0

#only gives back the rows in W greater than 0
df[df['W'] > 0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [11]:
#only returns the row in Z which is less than 0
df[df['Z'] < 0]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [12]:
result = df[df['W']>0]
result['X']

#or

df[df['W']>0]['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [13]:
#return multiple columns on the basis of 'W' column greater than 0
df[df['W']>0][['X', 'Y']]

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077
D -0.758872 -0.933237
E  1.978757  2.605967

In [14]:
df[(df['W']>0) & (df['Y']>1)]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [15]:
#reset_index removes the current index and sets it to numbers

newind = "CA NY WY OR CO".split()
'CA NY WY OR CO'.split()

#creating new columns
df['States'] = newind
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [16]:
#can use this method to set a column as index
df.set_index('States')

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

In [17]:
outside = ['G1', 'G1', 'G1', 'G2', 'G2', 'G2']
inside = [1,2,3,1,2,3]
#list of tuple pairs
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [18]:
df = pd.DataFrame(randn(6,2), hier_index, ['A','B'])
df

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [19]:
df.loc['G1']

          A         B
1  0.302665  1.693723
2 -1.706086 -1.159119
3 -0.134841  0.390528

In [20]:
#Give an outside and inside index name of your frame,
#can have as many layers of index as possible
df.index.names = ['Group', 'Num']
df
df.loc['G2'].loc[2]['B']

0.07295967531703869

For a dataframe rows can be accessed using dataframe.loc['row_name'] & columns can be accessed using [] operator on dataframes.

You can create dataframes using dictioneries, where dictionary indexes
are used as columns.

In [21]:
#Missing Data

d = {'A': [1,2, np.nan], 'B':[5, np.nan, np.nan], 'C':[1,2,3]}
df = pd.DataFrame(d)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [22]:
#pandas will drop all rows which has null value
#if specified with an argument axis="1" pandas will drop the columns
df.dropna()
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [23]:
#If you set thresh parameter then it will drop all rows which have non NaN 
#values less than the threshold number

df.dropna(thresh = 2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [24]:
#TO fill the null values
df.fillna(value='FILL VALUE')

#Fill the null values in column A with the mean of 'A'
df['A'].fillna(value=df['A'].mean(), inplace=True)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  1.5  NaN  3

In [25]:
#Groupby
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [26]:
byComp = df.groupby('Company')

#Can use aggregate functions on groupby

byComp.mean('Sales')

byComp.sum('Sales').loc['FB']

#or

df.groupby('Company').sum('Sales').loc['FB']

Sales    593
Name: FB, dtype: int64

In [27]:
df.groupby('Company').count()
#also can use max() and min()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [28]:
df.groupby('Company').describe()
df.groupby('Company').describe().loc['FB']

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64

Look at 06-Merging,Joining and Concatenating lecture.

In [29]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abcd','def','ghi','xyz']})
df.head()

   col1  col2  col3
0     1   444  abcd
1     2   555   def
2     3   666   ghi
3     4   444   xyz

In [30]:
#returns a numpy unique array of column 2
df['col2'].unique()

#the number of unique values, or use .len() in above
df['col2'].nunique()

3

In [31]:
df['col2'].value_counts()

col2
444    2
555    1
666    1
Name: count, dtype: int64

In [32]:
df[(df['col1'] > 2) & (df['col2'] == 444)]

   col1  col2 col3
3     4   444  xyz

In [33]:
def times2(x):
    return x*2

#apply() method is used to pass functions to a dataframe
df['col1'].apply(times2)
#or
df['col1'].apply(lambda x: x*2)

df['col3'].apply(len)

0    4
1    3
2    3
3    3
Name: col3, dtype: int64

In [34]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [35]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [36]:
df

   col1  col2  col3
0     1   444  abcd
1     2   555   def
2     3   666   ghi
3     4   444   xyz

In [37]:
#sorts columns by col2
df.sort_values(by='col2')

   col1  col2  col3
0     1   444  abcd
3     4   444   xyz
1     2   555   def
2     3   666   ghi

In [38]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [39]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
       'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [40]:
#based on excel
df.pivot_table(values='D', index=['A','B'], columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

Data Input and Output

- CSV
- Excel
- HTML
- SQL

In [41]:
pd.read_csv('example')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [42]:
df = pd.read_csv('example')

#create new csv file and write to it
#set index to false to not copy the index
df.to_csv('My_output', index=False)

pd.read_csv('My_output')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [43]:
pd.read_excel('Excel_Sample.xlsx', sheet_name='Sheet1')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [44]:
df.to_excel('Excel_Sample2.xlsx', sheet_name='NewSheet')

In [49]:
#like webscraping of pandas
data = pd.read_html('https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/')

In [53]:
type(data)
data[0].head()

,Bank NameBank,CityCity,StateSt,CertCert,Acquiring InstitutionAI,Closing DateClosing,FundFund
0,First Republic Bank,San Francisco,CA,59017,"JPMorgan Chase Bank, N.A.","May 1, 2023",10543
1,Signature Bank,New York,NY,57053,"Flagstar Bank, N.A.","March 12, 2023",10540
2,Silicon Valley Bank,Santa Clara,CA,24735,FirstCitizens Bank & Trust Company,"March 10, 2023",10539
3,Almena State Bank,Almena,KS,15426,Equity Bank,"October 23, 2020",10538
4,First City Bank of Florida,Fort Walton Beach,FL,16748,"United Fidelity Bank, fsb","October 16, 2020",10537

In [54]:
from sqlalchemy import create_engine

In [55]:
#creates a very small sqlite engine running in memory
engine = create_engine('sqlite:///:memory:')

In [57]:
#my_table is name of the table, engine is the connection to sql engine
df.to_sql("my_table", engine)

4

In [58]:
sqldf = pd.read_sql('my_table', con=engine)
sqldf

   index   a   b   c   d
0      0   0   1   2   3
1      1   4   5   6   7
2      2   8   9  10  11
3      3  12  13  14  15